<template>
<div id="CategoryAxis"></div>
</template>

<script>
  import * as d3 from 'd3';
  import {bb} from 'billboard.js'
  import Vue from 'vue';

  var category = [
                    "서울",
                    "부산",
                    "대구",
                    "인천",
                    "광주",
                    "대전",
                    "울산",
                    "세종",
                    "경기",
                    "강원",
                    "충북",
                    "충남",
                    "전북",
                    "전남",
                    "경북",
                    "경남",
                    "제주"                
                ];
    var datas = [
                ["1월",12.9,4.7,2.1,3,2.3,2.7,1.3,0.6,19.8,6.4,4.8,10,7,7.7,6.5,6.8,1.3],
                ["2월",16.2,3.6,2.3,4.2,2.7,4,1.4,0.2,21.4,5.6,6.8,9.6,5.7,6.1,4.3,4,1.9],
                ["3월",13.3,4.2,1.9,2.1,1.5,3.1,0.7,0.3,18.2,5.2,5.6,9.2,9.3,8.9,6.2,8.6,1.6],
                ["4월",11.2,4.1,1.8,3.5,1.4,2.8,1.3,0.2,17.7,5.4,5.8,11.4,7,7.9,6,9,3.6],
                ["5월",13.2	, 4.6	, 2.3	, 3.6,	 1.7	, 2.5,	 0.9	, 0.3,	 21.4	, 6.3,	 4.8,	 9.6,	 5.9,	 8.9,	 5.9,	 5.6,	 2.2],
                ["6월",12.6	, 3.5	, 1.6,	 3.8,	 1.5,	 3.2	, 0.7,	 0.5,	 22.1	, 5.9	, 6	, 8.8	, 8.9,	 5.5,	 4.6,	 7,	 4],
                ["7월",9.6,	 5.1	, 1.7	, 1.9,	 1	, 3.3	, 1.2	, 0.4	, 16.3,	 10.5	, 4.7	, 10.9	, 8.3,	 6.8	, 7.4,	 8.4,	 2.2],
                ["8월",7.6	, 7.2	, 1	, 3	 ,1.6,	 2.1,	 0.8,	 0.3,	 15.7	, 12.3	, 4.8,	 9.2	, 6.1,	 8,	 8,	 9.1,	 3.1],
                ["9월",13.9	, 4.9,	 2.5,	 3.5	, 1.8	, 2.3,	 1.9	, 0.3	, 18.2,	 6.3	, 5.3	, 10.3,	 7.8,	 6.4	, 5.1,	 7.6	, 2],
                ["10월",13.3	, 4.8	, 2.3,	 4.4	, 1.7	, 2.2	, 1.1,	 0.4	, 19.6	, 6.3,	 4.3,	 8.4	, 6.7, 7	, 7.9	, 7.4,	 2],
                ["11월",12.3	, 4.8	, 3.4,	 3.8	, 1.9	, 3.1	, 1.6	 ,0.3	, 16.4	, 5.9	, 7	, 7.8,	 8.9	, 7.2	, 4.9	, 7.7	, 3.2],
                ["12월",14.2,	 7.5	, 2.6,	 3.3	, 1.8	, 2.5	, 1.5	, 0.6,	 20	, 8	, 3.5,	 8,	 6.3	, 5,	 5.7	, 6.8,	 2.7],
                

            ]
   

  export default {
    name: 'Month',
    data() {
      return { 
        
      }
    },
    mounted() {
    this.draw()

    },
    methods: {

     
      draw() {
       

       var chart = bb.generate({
         data: {
         columns: datas,
         shown: datas[0],
         type: "bubble",
         labels: true
            
         },
         bubble: {
           maxR: 50
         },
        axis: {
             x: {
                 type: "category",
                categories: category
                }
            },   
         bindto: "#CategoryAxis"
        });
       
        
       
        
        
      }
    }
  }

</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->

<style scoped>
    #CategoryAxis{
        top: 12%;
        left: 10%;
        background-color:#414040;
        width:1200px;
        height:600px;
        fill:aliceblue;
    }
  

  
   text{
     fill:rgb(255, 252, 252);
   }


</style>
